[
  {
    "version": "1.10.0",
    "date": "2025-10-22",
    "title": "تحسينات ناشر الأدوات وإضافة أدوات الهندسة الصوتية",
    "description": "تم تحديث ناشر الأدوات بتحسينات في الواجهة والأداء، وتم إضافة 10 أدوات جديدة للهندسة الصوتية (عزل الضوضاء، تحسين الصوت، إلخ) ضمن الاشتراك المميز والتجربة المجانية."
  },
  {
    "version": "1.9.0",
    "date": "2025-10-17",
    "title": "إضافة نظام الاشتراك المميز",
    "description": "تمت إضافة نظام اشتراك جديد يوفر وصولاً كاملاً إلى 50 أداة مميزة مع فترة تجريبية مجانية لمدة 30 يومًا. يتضمن النظام إدارة الاشتراكات، وتقييد الوصول للأدوات، وحدود الاستخدام اليومي للمستخدمين المجانيين."
  },
  {
    "version": "1.8.0",
    "date": "2025-10-14",
    "title": "إضافة المستندات القانونية",
    "description": "تم إضافة سياسة الخصوصية، اتفاقية ترخيص المستخدم، وشروط الخدمة إلى الموقع. هذه المستندات متاحة في فئة منفصلة وفي تذييل الموقع."
  },
  {
    "version": "1.7.0",
    "date": "2025-10-14",
    "title": "إضافة نظام التحكم في الوصول لأدوات المطورين",
    "description": "تم إضافة نظام مصادقة للمطورين مع إعدادات خصوصية متقدمة. يمكن للمطورين الآن اختيار مستوى رؤية أدواتهم (خاصة، غير مدرجة، عامة) والتحكم في صلاحيات النسخ والتعديل."
  },
  {
    "version": "1.6.0",
    "date": "2025-10-14",
    "title": "إضافة أدوات نشر وإدارة أدوات المطورين",
    "description": "تم إضافة أداتين جديدتين: نشر أدوات المطورين للسماح للمطورين بنشر أدواتهم المخصصة، وإدارة أدوات المطورين لعرض وإدارة الأدوات المنشورة. هذه الأدوات تتضمن وظائف التحقق من صحة الكود والمعاينة المباشرة."
  },
  {
    "version": "1.5.0",
    "date": "2025-10-14",
    "title": "تحديث صفحة ما الجديد وإضافة معلومات الإصدار",
    "description": "تم تحديث ملف whats-new-data.json لإضافة معلومات الإصدار الجديدة، وتم تحسين مكون WhatsNew.jsx لعرض هذه المعلومات بشكل فعال."
  },
  {
    "version": "1.4.0",
    "date": "2025-10-14",
    "title": "إضافة تحديث جديد لصفحة ما الجديد",
    "description": "تم إضافة تحديث جديد لصفحة ما الجديد بناءً على طلب المستخدم، مع رقم إصدار جديد ووصف مفصل."
  },
  {
    "version": "1.3.0",
    "date": "2025-10-14",
    "title": "تحسين دقة وصف الفيديو وإضافة قسم التحديثات",
    "description": "تم تحسين دقة أداة وصف المشهد في الفيديو بشكل كبير لتوفير أوصاف أكثر تفصيلاً ودقة. كما تم إضافة قسم \"الجديد من آخر التحديثات\" لإبقاء المستخدمين على اطلاع بآخر الميزات والتحسينات."
  },
  {
    "version": "1.2.0",
    "date": "2025-10-13",
    "title": "إضافة ثلاث أدوات جديدة متقدمة",
    "description": "تمت إضافة ثلاث أدوات جديدة وقوية: قارئ الألوان، قارئ النص من الفيديو، ووصف المشهد في الفيديو. هذه الأدوات تستخدم تقنيات متقدمة لتوفير وظائف حقيقية ومفيدة للمستخدمين."
  },
  {
    "version": "1.1.0",
    "date": "2025-10-12",
    "title": "دعم اللغات المتعددة",
    "description": "تمت إضافة دعم لعشر لغات جديدة بالإضافة إلى العربية، مما يجعل الموقع متاحًا لجمهور أوسع حول العالم. يمكن للمستخدمين الآن التبديل بسهولة بين اللغات المدعومة."
  },
  {
    "version": "1.0.0",
    "date": "2025-10-11",
    "title": "الإطلاق الأولي للموقع",
    "description": "تم إطلاق الإصدار الأول من موقع أدوات النفاذ الرقمي مع 15 أداة أساسية مصممة خصيصًا لتحسين تجربة المكفوفين وضعاف البصر مع التكنولوجيا الحديثة."
  }
]
